[
  {
    "id": "trump-ai-day-2025-07-23",
    "date": "2025-07-23",
    "ticker": "NVDA",
    "headline": "Trump Declares National 'AI Day,' Pledging U.S. Leadership in Artificial Intelligence",
    "summary": "In a campaign-style announcement, former President Trump declared July 23 as 'AI Day,' highlighting America's commitment to dominate the global AI race. The statement emphasized job creation and U.S. investment in data-center infrastructure.",
    "logic": "The event boosted overall risk sentiment toward the technology sector, reinforcing the narrative that AI remains a policy and market priority.",
    "impact": "bullish",
    "impactScore": 7,
    "category": "policy",
    "source": "Reuters",
    "createdAt": "2025-07-23T09:00:00Z",
    "updatedAt": "2025-07-23T09:00:00Z"
  },
  {
    "id": "us-china-metals-deal-2025-07-28",
    "date": "2025-07-28",
    "ticker": "NVDA",
    "headline": "U.S. and China Reach Tentative Deal on Raw Metal Tariffs and Export Quotas",
    "summary": "The two nations agreed to ease restrictions on key industrial and semiconductor-related metals, including gallium and graphite, previously subject to export curbs. Both sides signaled an intent to stabilize supply chains ahead of the U.S. election cycle.",
    "logic": "Reduced macro uncertainty and lower input-cost pressure for global manufacturing improved overall risk appetite.",
    "impact": "bullish",
    "impactScore": 6,
    "category": "policy",
    "source": "Bloomberg",
    "createdAt": "2025-07-28T08:30:00Z",
    "updatedAt": "2025-07-28T08:30:00Z"
  },
  {
    "id": "nvidia-china-revenue-exclusion-2025-04-15",
    "date": "2025-04-15",
    "ticker": "NVDA",
    "headline": "NVIDIA to Exclude China-Related Revenue from Official Financial Reporting Amid Regulatory Scrutiny",
    "summary": "NVIDIA stated that future filings would no longer include sales to Chinese entities within its reported geographic segments due to U.S. export-control compliance. Analysts estimated China previously contributed roughly 20% of profits.",
    "logic": "The announcement implied a material contraction in short-term total addressable market and introduced valuation uncertainty.",
    "impact": "bearish",
    "impactScore": -7,
    "category": "regulatory",
    "source": "Wall Street Journal",
    "createdAt": "2025-04-15T16:00:00Z",
    "updatedAt": "2025-04-15T16:00:00Z"
  },
  {
    "id": "nvidia-blackwell-production-ramp-2025-10-12",
    "date": "2025-10-12",
    "ticker": "NVDA",
    "headline": "NVIDIA Announces Blackwell GPU Production Ramp Ahead of Schedule",
    "summary": "NVIDIA confirmed that its next-generation Blackwell architecture GPUs are entering mass production two weeks ahead of initial guidance, with first shipments to hyperscale customers expected in Q4 2025.",
    "logic": "Accelerated product timeline signals strong demand and improved supply chain execution, likely driving upward revenue revisions for fiscal year estimates.",
    "impact": "bullish",
    "impactScore": 8,
    "category": "product",
    "source": "NVIDIA Press Release",
    "createdAt": "2025-10-12T07:00:00Z",
    "updatedAt": "2025-10-12T07:00:00Z"
  },
  {
    "id": "doj-antitrust-probe-nvidia-2025-10-12",
    "date": "2025-10-12",
    "ticker": "NVDA",
    "headline": "DOJ Expands Antitrust Probe into NVIDIA's AI Chip Bundling Practices",
    "summary": "The Department of Justice has issued additional subpoenas to NVIDIA and several cloud computing partners, investigating whether the company unfairly ties software and hardware sales to maintain market dominance in AI accelerators.",
    "logic": "Regulatory overhang creates uncertainty around business model flexibility and could limit pricing power or bundling strategies, weighing on near-term sentiment.",
    "impact": "bearish",
    "impactScore": -6,
    "category": "regulatory",
    "source": "Financial Times",
    "createdAt": "2025-10-12T10:30:00Z",
    "updatedAt": "2025-10-12T10:30:00Z"
  },
  {
    "id": "fed-rate-hold-inflation-2025-10-12",
    "date": "2025-10-12",
    "ticker": "NVDA",
    "headline": "Federal Reserve Holds Rates Steady, Signals Data-Dependent Approach Through Year-End",
    "summary": "The Fed kept interest rates unchanged at 5.25-5.50%, citing stable inflation trends but cautioning against premature easing. Chair Powell emphasized continued monitoring of labor market and growth indicators.",
    "logic": "Neutral rate stance removes immediate catalyst for tech valuation expansion but avoids negative surprise, maintaining status quo for high-growth equities.",
    "impact": "neutral",
    "impactScore": 0,
    "category": "macro",
    "source": "Federal Reserve",
    "createdAt": "2025-10-12T14:00:00Z",
    "updatedAt": "2025-10-12T14:00:00Z"
  },
  {
    "id": "nvidia-microsoft-ai-partnership-2025-10-13",
    "date": "2025-10-13",
    "ticker": "NVDA",
    "headline": "NVIDIA and Microsoft Announce 5-Year Strategic AI Infrastructure Partnership",
    "summary": "NVIDIA and Microsoft signed a multi-billion dollar agreement to co-develop custom AI chips and expand Azure's GPU capacity using NVIDIA's H200 and Blackwell platforms. The deal includes joint R&D on next-generation AI accelerators.",
    "logic": "Long-term supply commitment with a key hyperscaler reduces revenue volatility and validates NVIDIA's technology roadmap, strengthening competitive moat.",
    "impact": "bullish",
    "impactScore": 9,
    "category": "partnership",
    "source": "Microsoft Newsroom",
    "createdAt": "2025-10-13T08:00:00Z",
    "updatedAt": "2025-10-13T08:00:00Z"
  },
  {
    "id": "nvidia-automotive-delay-2025-10-13",
    "date": "2025-10-13",
    "ticker": "NVDA",
    "headline": "NVIDIA Delays DRIVE Thor Platform Launch to Mid-2026 Citing Safety Validation",
    "summary": "NVIDIA announced a six-month delay for its autonomous vehicle computing platform DRIVE Thor, now targeting commercial availability in Q2 2026. The company cited extended safety certification and customer integration timelines.",
    "logic": "Automotive segment represents a key diversification opportunity; delays suggest execution risk and push out revenue contribution from this growth vertical.",
    "impact": "bearish",
    "impactScore": -4,
    "category": "product",
    "source": "Automotive News",
    "createdAt": "2025-10-13T11:00:00Z",
    "updatedAt": "2025-10-13T11:00:00Z"
  },
  {
    "id": "semiconductor-capex-outlook-2025-10-13",
    "date": "2025-10-13",
    "ticker": "NVDA",
    "headline": "Global Semiconductor CapEx Forecast Raised 12% for 2025 on AI Demand",
    "summary": "Industry analysts upgraded worldwide semiconductor capital expenditure projections, citing sustained AI infrastructure buildout by cloud providers. TSMC, Samsung, and Intel are all increasing fab capacity for advanced nodes.",
    "logic": "Broad-based industry investment confirms structural AI demand trends and supports NVIDIA's growth narrative, though benefits are shared across the value chain.",
    "impact": "bullish",
    "impactScore": 5,
    "category": "macro",
    "source": "Semiconductor Industry Association",
    "createdAt": "2025-10-13T13:30:00Z",
    "updatedAt": "2025-10-13T13:30:00Z"
  },
  {
    "id": "nvidia-q3-earnings-preview-2025-10-14",
    "date": "2025-10-14",
    "ticker": "NVDA",
    "headline": "NVIDIA Q3 Earnings Preview: Analysts Expect 80% Revenue Growth, Eyes on Guidance",
    "summary": "Wall Street consensus forecasts NVIDIA will report Q3 revenue of $32.5 billion, up 80% year-over-year, with data center segment expected to account for 85% of sales. Focus will be on Q4 outlook and gross margin trends.",
    "logic": "High expectations create both upside and downside risk; strong results could drive further momentum, while any miss or cautious guidance may trigger profit-taking.",
    "impact": "neutral",
    "impactScore": 0,
    "category": "earnings",
    "source": "FactSet",
    "createdAt": "2025-10-14T06:00:00Z",
    "updatedAt": "2025-10-14T06:00:00Z"
  },
  {
    "id": "nvidia-omniverse-enterprise-launch-2025-10-14",
    "date": "2025-10-14",
    "ticker": "NVDA",
    "headline": "NVIDIA Launches Omniverse Enterprise 2.0 with Real-Time Industrial Digital Twin Capabilities",
    "summary": "NVIDIA unveiled Omniverse Enterprise 2.0, featuring enhanced physics simulation, AI-powered asset generation, and integration with major CAD platforms. Initial customers include BMW, Siemens, and Lockheed Martin.",
    "logic": "Expansion into enterprise software and digital twin markets demonstrates diversification beyond core GPU sales, opening new high-margin recurring revenue streams.",
    "impact": "bullish",
    "impactScore": 6,
    "category": "product",
    "source": "NVIDIA Blog",
    "createdAt": "2025-10-14T09:00:00Z",
    "updatedAt": "2025-10-14T09:00:00Z"
  },
  {
    "id": "nvidia-class-action-lawsuit-2025-10-14",
    "date": "2025-10-14",
    "ticker": "NVDA",
    "headline": "Investor Class Action Filed Against NVIDIA Over Alleged Crypto Mining Revenue Misstatements",
    "summary": "A securities class action lawsuit was filed in California federal court alleging NVIDIA failed to properly disclose cryptocurrency mining's contribution to gaming GPU sales during 2023-2024, misleading investors about revenue sustainability.",
    "logic": "Legal risk introduces headline and sentiment overhang, though materiality unclear; potential distraction for management and modest financial liability if case proceeds.",
    "impact": "bearish",
    "impactScore": -3,
    "category": "lawsuit",
    "source": "Law360",
    "createdAt": "2025-10-14T15:00:00Z",
    "updatedAt": "2025-10-14T15:00:00Z"
  }
]
